# Задача 4: Поиск уникальных элементов в списке. Напишите программу, которая создает новый список,
# содержащий только уникальные элементы из исходного списка.


nums = [3, 5, 2, 8, 9, 5, 5, 5, 7, 7]
result_nums = set(nums)

print(result_nums)
