# Задача 3: Вычисление факториала числа. Напишите программу, которая находит факториал заданного числа
# N с использованием рекурсии или встроенных функций.

import math

N = int(input("Введите число для расчета факториала: "))
print(math.factorial(N))